{
  "Valentin THOMAS": "Valentin THOMAS",
  "Fullstack Developer": "Fullstack Developer",
  "me@valentin-thomas.com": "me@valentin-thomas.com",
  "LinkedIn": "LinkedIn",
  "Portfolio": "Portfolio",
  "Github": "Github",
  "Summary": "Sommaire",
  "France": "France",
  "As a <1>Fullstack Developer</1>, I have had the opportunity to work on projects such as a <4>client portal</4> for insurance companies and a <7>clients management application</7> for a Crematorium in various environments. These experiences demonstrate my adaptability and my area of expertise.": "En tant que <1>Fullstack Developer</1>, j'ai eu l'occasion de travailler sur des projets tels qu'un <4>portail client</4> pour des compagnies d'assurance et une <7>application de gestion des clients</7> pour un crématorium dans différents environnements. Ces expériences démontrent mon adaptabilité et mon domaine d'expertise.",
  "My objective is to be part of a team where we collaborate to create <2>high-quality products</2>, and where my passion for software development and <5>ability to find solutions</5> in the face of <8>unexpected challenges</8> play a role in the overall success of the company.": "Mon objectif est de faire partie d'une équipe où nous collaborons pour créer des <2>produits de haute qualité</2>, et où ma passion pour le développement logiciel et ma <5>capacité à trouver des solutions</5> face à des <8>défis inattendus</8> jouent un rôle dans le succès global de l'entreprise.",
  "Skills": "Compétences clés",
  "Native <1>French</1> speaker and intermediate English speaker": "Locuteur natif de <1>français</1> et niveau intermédiaire en anglais",
  "Advanced computer skills": "Compétences informatiques avancées",
  "<0>Autonomous</0> and able to work in a team": "<0>Autonome</0> et capable de travailler en équipe",
  "<0>Curious</0> of new technologies": "<0>Curieux</0> des nouvelles technologies",
  "Bring a <1>creative</1> and <3>innovative</3> vision": "Apporter une vision <1>créative</1> et <3>innovante</3>",
  "Have already work with <1>Agile methodology</1> and associated tools like <3>Jira</3>, <6>Confluence</6> and <8>Trello</8>": "A déjà travaillé avec la méthodologie <1>Agile</1> et des outils associés tels que <3>Jira</3>, <6>Confluence</6> et <8>Trello</8>",
  "Experience": "Expériences professionnelles",
  "MeilleurSCPI": "MeilleurSCPI",
  "Real estate investment platform": "Plateforme d'investissement immobilier",
  "Working on an investment portfolio management platform": "J'ai eu l'opportunité de travailler sur une plateforme de gestion de portefeuille d'investissement en SCPI.",
  "Developing a <1>Scrapping service</1> to retrieve public datas.": "Développement d'un <1>service de scrapping</1> pour récupérer des données publiques.",
  "Programming in <1>PHP</1> with a legacy framework and integration of <3>VueJS 2</3>.": "Programmation en <1>PHP</1> avec un framework existant et intégration de <3>VueJS 2</3>.",
  "Working on improving the developer experience with <2>Docker containerization</2> and <5>Unit Testing</5>.": "Travail sur l'amélioration de l'expérience des développeurs avec la <2>conteneurisation Docker</2> et les <5>tests unitaires</5>.",
  "<0>startup environment</0> and <3>small team</3>": "<0>environnement de start-up</0> et <3>petite équipe</3>",
  "Solicis": "Solicis",
  "Society of prestations in IT": "Société de prestations informatiques",
  "Deepening of knowledge in <1>PHP</1>": "Approfondissement des connaissances en <1>PHP</1>",
  "Starting to learn the development with the <2>Zend Framework</2>": "Début d'apprentissage du développement avec le <2>Zend Framework</2>",
  "MonBuilding": "MonBuilding",
  "Startup building a platform to manage buildings and their occupants": "Start-up développant une plateforme pour gérer les bâtiments et leurs occupants",
  "Learning of <1>NodeJS</1> with <4>Meteor</4> and <6>React</6>.": "Apprentissage de <1>NodeJS</1> avec <4>Meteor</4> et <6>React</6>.",
  "Discovering the development of <2>Realtime interfaces</2> and <5>MongoDB</5>": "Cette expérience a été importante pour moi car elle m'a permis de découvrir les <2>interfaces en temps réel</2> et <5>MongoDB</5>",
  "Working in an <1>International team</1> with <4>remote work</4> and coworker located in Peru": "Travail au sein d'une <1>équipe internationale</1> avec du <4>télétravail</4> et des collègues basés au Pérou",
  "C# Software Developer": "Développeur logiciel C#",
  "Ededoc": "Ededoc",
  "Society in charge of developing a virtual printer to manage the dematerialization of documents": "Société chargée du développement d'une imprimante virtuelle pour gérer la dématérialisation des documents",
  "Learning <1>C#</1> and <4>.NET framework</4> with the SOLID principles.": "Apprentissage de <1>C#</1> et du <4>framework .NET</4> avec les principes SOLID.",
  "Developing a service for <1>Email Tracking</1> and <4>document electronic signing</4> in the workflows": "Développement d'un service de <1>suivi des e-mails</1> et de <4>signature électronique des documents</4> dans les workflows",
  "Developing a <1>NodeJS</1> scrapping service to recover invoices.": "Développement d'un service de <1>scrapping NodeJS</1> pour récupérer des factures.",
  "Developing a notification system for users to subscribe to the platform news with <1>NodeJS and postgresql</1>": "Developpement d'un systeme de notification pour la souscriptions des utilisateurs au nouveautés avec <1>NodeJS et postgresql</1>",
  "F.ASS.T": "F.ASS.T",
  "Startup developing platforms for insurers and their customers": "Startup développant des plateformes pour les assureurs et leurs clients",
  "Developing services in <1>NodeJS</1> with <4>Typescript</4>": "Développement de services en <1>NodeJS</1> avec <4>Typescript</4>",
  "Working on a platform for an insurer <2>from the early stage to production</2>": "Travail sur une plateforme pour un assureur <2>de la phase initiale à la production</2>",
  "<0>Joining the architect's team</0> to help structure the multiples projects of the enterprise and <3>make the developers work easier</3>.": "<0>Rejoindre l'équipe d'architectes</0> pour aider à structurer les multiples projets de l'entreprise et <3>faciliter le travail des développeurs</3>.",
  "<0>Handling the animation of multiples workshops</0> to share knowledge between the teams members and <4>in charge of promoting</4> internal monthly workshops events.": "<0>Animation de multiples ateliers</0> pour partager des connaissances entre les membres des équipes et <3>chargé de promouvoir</3> les événements mensuels d'ateliers internes.",
  "Making the presentation of the society and the projects to students and <1>managing the formation</1> of the new employees.": "Présentation de la société et des projets aux étudiants et <2>gestion de la formation</2> des nouveaux employés.",
  "Education": "Éducation",
  "Intensive and autonomous training in software development, with intensive learning of C and PHP": "Formation intensive et autonome en développement de logiciels, avec un apprentissage intensif de C et PHP",
  "Personal projects": "Projets personnels",
  "The DeadSafe": "The DeadSafe",
  "The DeadSafe project is an ambitious <2>decentralized management game based on NFTs</2>, with the aim of unlocking access to a safe.": "Le projet DeadSafe est un ambitieux <2>jeu de gestion décentralisé basé sur les NFT</2>, avec pour objectif de déverrouiller l'accès à un coffre-fort.",
  "DeadSafe is currently being developed. However, partial documentation of the project is already available on the website": "DeadSafe est actuellement en cours de développement. Cependant, une documentation partielle du projet est déjà disponible sur le site web",
  "BaseMint": "BaseMint",
  "The Basemint project is a fan art whose goal is to learn about using <2>web3</2> and interacting with an <5>Ethereum contract</5>. In this case, the contract is for VirtueAnimation's BaseMint Buds NFT.": "Le projet Basemint est un fan art dont le but est d'apprendre à utiliser <2>web3</2> et d'interagir avec un <5>contrat Ethereum</5>. Dans ce cas, le contrat concerne le NFT BaseMint Buds de VirtueAnimation.",
  "I was able to learn how to display the basic information of a contract and interact with it through <1>JavaScript.</1>": "J'ai pu apprendre à afficher les informations de base d'un contrat et à interagir avec celui-ci grâce à <1>JavaScript.</1>",
  "Andromeda": "Andromeda",
  "Andromeda is an application designed to help developers better manage their time and remember what they accomplished the previous day. It offers an <1>easy-to-use Kanban interface</1> that allows developers to track their work day and recall what they accomplished during their Daily. This application is developed in <4>Meteor with React and uses MongoDB</4> as its database. It enables developers to better organize their work and <7>track their progress effectively.</7>": "Andromeda est une application conçue pour aider les développeurs à mieux gérer leur temps et se souvenir de ce qu'ils ont accompli la veille. Elle propose une <1>interface Kanban facile à utiliser</1> qui permet aux développeurs de suivre leur journée de travail et de se rappeler ce qu'ils ont accompli pendant leur Daily. Cette application est développée en utilisant <4>Meteor avec React et utilise MongoDB</4> comme base de données. Elle permet aux développeurs d'organiser plus efficacement leur travail et de <7>suivre leur progression de manière efficace.</7>",
  "I was able to take advantage of creating this application to work on an interface that provides a visual state of things through page animations.": "J'ai pu profiter de la création de cette application pour travailler sur une interface qui offre un état visuel des choses grâce à des animations de page.",
  "Styx": "Styx",
  "Styx is a <1>client management application</1> for crematoriums. It allows easy management of deceased clients and associated information.": "Styx est une application de gestion de <1>clients</1> pour les crématoriums. Elle permet une gestion facile des clients décédés et des informations associées.",
  "This application is a <1>complete SaaS</1> developed independently to quickly meet a need. It required a long development time but is still in production with regular updates to continue to meet the needs.": "Cette application est un <1>service SaaS complet</1> développé indépendamment pour répondre rapidement à un besoin. Elle a nécessité un long temps de développement, mais elle est toujours en production avec des mises à jour régulières pour continuer à répondre aux besoins.",
  "The current version is in PHP with MariaDB, but developments are focused on implementation through a <2>TypeScript stack using Remix, TailwindCSS, and Postgresql.</2>": "La version actuelle est en PHP avec MariaDB, mais les développements sont axés sur une implémentation à l'aide d'une <2>pile TypeScript utilisant Remix, TailwindCSS et Postgresql.</2>",
  "Bellz": "Bellz",
  "Bellz is a <1>personal accounting management application</1> that helps individuals better manage their finances. It lists transactions and accounts in an organized manner, facilitating financial decision making. The application also allows users to share this information with others, which can be useful when working as a couple or as a family. Available as a web service, Bellz allows users to track their accounting from anywhere and at any time. By using this application, individuals can more efficiently and effectively reach their financial goals.\"": "Bellz est une application de <1>gestion de la comptabilité personnelle</1> qui aide les individus à mieux gérer leurs finances. Elle répertorie les transactions et les comptes de manière organisée, facilitant la prise de décision financière. L'application permet également aux utilisateurs de partager ces informations avec d'autres personnes, ce qui peut être utile lorsqu'on travaille en couple ou en famille. Disponible en tant que service web, Bellz permet aux utilisateurs de suivre leur comptabilité de n'importe où et à tout moment. En utilisant cette application, les individus peuvent atteindre leurs objectifs financiers de manière plus efficace et plus efficacement.\"",
  "This application was built around <1>Remix</1> to learn how to use this framework as well as learn some optimization techniques to reduce loading time and make the application as fast as possible. It was designed to allow for <3>JavaScript-free</3> use on the front-end as well as in highly degraded network conditions.": "Cette application a été construite autour de <1>Remix</1> afin d'apprendre à utiliser ce framework ainsi que certaines techniques d'optimisation pour réduire le temps de chargement et rendre l'application aussi rapide que possible. Elle a été conçue pour permettre une utilisation sans <3>JavaScript</3> côté client, ainsi que dans des conditions de réseau fortement dégradées.",
  "It also allowed me to create a <2>project foundation based on Remix, TailwindCSS, and Revolut</2> in order to have a complete and performant SaaS service template.": "Cela m'a également permis de créer une <2>base de projet basée sur Remix, TailwindCSS et Revolut</2> afin d'avoir un modèle de service SaaS complet et performant.",
  "This application is currently in production and used by my family to manage the budget and finances.": "Cette application est actuellement en production et utilisée par ma famille pour gérer le budget et les finances.",
  "July 2014 & July 2015": "Juillet 2014 & Juillet 2015",
  "August 2017 - May 2018": "Août 2017 - Mai 2018",
  "May 2018 - August 2018": "Mai 2018 - Août 2018",
  "August 2018 - October 2018": "Août 2018 - Octobe 2018",
  "November 2018 - July 2020": "Novembre 2018 - Juillet 2020",
  "July 2020 to now": "Juillet 2020 à aujourd'hui",
  "footer": "Ce CV a été générer en code sur https://valentin-thomas.com"
}
